artillery.yml
config:
  target: 'http://localhost:3000'
  phases:
    - duration: 60
      arrivalRate: 20
scenarios:
  - flow:
      - post:
          url: "/todos"
          json:
            title: "Tomatoes"
            description: "Water your tomatoes"
            completed: false
      - get:
          url: "/todos"